Figure_18/zfs_qat_test/silesia_chunk_4kread_lat_test/latency_res/09_29-10_56/nocomp/32K/out_09_29-11_01_40.txt
#############################################################
align: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.35-118-g4a0c76
Starting 1 process

align: (groupid=0, jobs=1): err= 0: pid=4559: Sun Sep 29 11:02:47 2024
  read: IOPS=5860, BW=22.9MiB/s (24.0MB/s)(1513MiB/66081msec)
    clat (usec): min=5, max=1199, avg=97.35, stdev=24.24
     lat (usec): min=5, max=1199, avg=97.37, stdev=24.24
    clat percentiles (usec):
     |  1.00th=[   78],  5.00th=[   82], 10.00th=[   84], 20.00th=[   86],
     | 30.00th=[   88], 40.00th=[   90], 50.00th=[   92], 60.00th=[   94],
     | 70.00th=[   97], 80.00th=[  103], 90.00th=[  117], 95.00th=[  131],
     | 99.00th=[  202], 99.50th=[  235], 99.90th=[  351], 99.95th=[  388],
     | 99.99th=[  494]
   bw (  KiB/s): min= 7704, max=29496, per=100.00%, avg=23453.13, stdev=3629.46, samples=132
   iops        : min= 1926, max= 7374, avg=5863.27, stdev=907.37, samples=132
  lat (usec)   : 10=0.18%, 20=0.01%, 50=0.02%, 100=76.10%, 250=23.31%
  lat (usec)   : 500=0.37%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=43.12%, sys=6.35%, ctx=388503, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=100.0%, 4=0.1%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=387238,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.9MiB/s (24.0MB/s), 22.9MiB/s-22.9MiB/s (24.0MB/s-24.0MB/s), io=1513MiB (1586MB), run=66081-66081msec
 
zfs_prefetch_disable: 1
zfs_arc_max_val: 0
zfs_arc_min_val: 0
zfs_qat_compress_disable: 
 
compress_type: NAME         PROPERTY     VALUE           SOURCE
mypool/myfs  compression  off             local
 
blocksize: NAME         PROPERTY    VALUE    SOURCE
mypool/myfs  recordsize  32K      local
 
iters: 2
output_path: ./latency_res/09_29-10_56/nocomp/32K